[{"date": "2021-03-12", "title": "McConnell quietly courts Senate primary candidates 'who can win' regardless of Trump ties", "full article": "(CNN)Senate Minority Leader Mitch McConnell is quietly maneuvering to field a slate of GOP Senate candidates in critical battleground states, attempting to avoid a repeat of election cycles a decade … [+10897 chars]", "author": "Manu Raju and Alex Rogers, CNN"}, {"date": "2021-03-12", "title": "George Takei on how Trump exacerbated anti-Asian hate", "full article": null, "author": null}, {"date": "2021-03-12", "title": "The week in 13 headlines", "full article": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!", "author": "Sonnet Swire, CNN"}, {"date": "2021-03-12", "title": "Biden tees up a hopeful Independence Day", "full article": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!", "author": "Analysis by Lauren Dezenski, CNN"}, {"date": "2021-03-12", "title": "With new nursing home guidelines, card games with grandpa are back, regardless of your vaccination status", "full article": "(CNN)You can hug your vaccinated grandpa and stay to play cards with him at his nursing home, even if you haven't been vaccinated, according to new Covid-19 guidance for nursing homes from the Center… [+6191 chars]", "author": "Jen Christensen, CNN"}, {"date": "2021-03-12", "title": "Jennifer Lopez and Alex Rodriguez split", "full article": null, "author": "Marianne Garvey, CNN"}, {"date": "2021-03-12", "title": "The bitter irony in the GOP trying to curtail voting rights", "full article": "Fred Wertheimer is president of Democracy 21, a nonpartisan, non-profit organization that works to strengthen US democracy and empower citizens in the political process. The opinions expressed here a… [+8230 chars]", "author": "Opinion by Fred Wertheimer"}, {"date": "2021-03-12", "title": "Alex Jones allegedly threatened to throw Trump rally organizer off a stage", "full article": "(CNN)Police in Washington, DC, are investigating an allegation that conspiracy theorist Alex Jones threatened to push a pro-Trump political organizer off of an event stage in December, according to p… [+5606 chars]", "author": "Curt Devine, Drew Griffin and Zachary Cohen, CNN"}, {"date": "2021-03-12", "title": "An announcer hurled racial insults at a high school basketball team for kneeling during the National Anthem", "full article": "(CNN)The Norman, Oklahoma, Public Schools District is condemning an announcer who \"made racist and hateful comments targeted at our Norman High student athletes\" on a livestream of a state basketball… [+2349 chars]", "author": "Konstantin Toropin, CNN"}, {"date": "2021-03-12", "title": "Biden administration grants humanitarian protection for Burmese in US", "full article": null, "author": "Geneva Sands, CNN"}, {"date": "2021-03-12", "title": "Why George Floyd's memorial site is surrounded by barricades", "full article": null, "author": null}, {"date": "2021-03-12", "title": "Two women facing charges for allegedly harassing Uber driver in mask dispute", "full article": "(CNN)When Subhakar Khadka immigrated to California seven years ago, he had his sights set on a simple life with simple goals: Earn a living so that his family in Nepal can join him in the United Stat… [+7537 chars]", "author": "Alisha Ebrahimji, CNN"}, {"date": "2021-03-12", "title": "'A vote is what we need': Gun safety bill faces uphill climb in Senate", "full article": "(CNN)Senate Democrats will move forward on new gun legislation, promising to bring a bill expanding background checks on all firearm sales to the floor for a vote, despite the uphill climb ahead to g… [+5960 chars]", "author": "Jessica Dean, Ali Zaslav and Daniella Diaz, CNN"}, {"date": "2021-03-12", "title": "Trying travel: Will it ever be easy again?", "full article": null, "author": null}, {"date": "2021-03-12", "title": "ICE asks for agency volunteers to assist at the US-Mexico border amid surge of migrant children", "full article": "(CNN)Immigration and Customs Enforcement asked for volunteers from the agency to support the federal government's efforts along the US-Mexico border as the Biden administration continues to grapple w… [+877 chars]", "author": "Geneva Sands, CNN"}, {"date": "2021-03-12", "title": "Matthew McConaughey, stay out of Texas politics", "full article": "James Moore is a political analyst, author and business communications consultant who has been writing and reporting on Texas politics since 1975. He is the founder of Big Bend Strategies and publish… [+6108 chars]", "author": "Opinion by James Moore"}, {"date": "2021-03-12", "title": "Size-inclusive label Summersalt just launched intimates", "full article": "Size-inclusive brand Summersalt, which is lauded for both its great fits and sleek shapes, is looking to take over your top drawer with a new intimates collection. And yes, you can bet the fits are h… [+994 chars]", "author": "By Krystin Arneson"}, {"date": "2021-03-12", "title": "Judge releases alleged Oath Keeper and questions strength of conspiracy case", "full article": "(CNN)A federal judge ordered one of the alleged Oath Keepers charged in the Capitol riot to be released on Friday, and questioned the strength of the conspiracy case against him.\r\nThomas Caldwell, a … [+1220 chars]", "author": "Marshall Cohen"}, {"date": "2021-03-12", "title": "The next Keystone XL fight is here", "full article": null, "author": null}, {"date": "2021-03-12", "title": "White House warns organizations have 'hours, not days' to fix vulnerabilities as Microsoft Exchange attacks increase", "full article": "Washington (CNN)The Biden administration warned Friday that organizations face enormous risks from the recently disclosed Microsoft Exchange vulnerabilities that have affected thousands of private or… [+5448 chars]", "author": "Brian Fung and Alex Marquardt, CNN"}]